УТ/src/Catalogs/CRM_СтатусыРаботыСКлиентом/CRM_СтатусыРаботыСКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СтатусыРаботыСКлиентом</name>
  <comment>Статусы работы с клиентом</comment>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановки</name>
    <type>
      <types>EnumRef.CRM_СпособыУстановкиСтатусаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиРасчета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/InformationRegisters/CRM_НастройкиРасположенияЭлементовНаФормах/CRM_НастройкиРасположенияЭлементовНаФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НастройкиРасположенияЭлементовНаФормах</name>
  <resources>
    <name>ЗаголовокЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЭлементаРазмещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокРасположения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/CRM_СпособыУстановкиСтатусаКлиента/CRM_СпособыУстановкиСтатусаКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СпособыУстановкиСтатусаКлиента</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>Автоматически</name>
  </enumValues>
  <enumValues>
    <name>ДляНовогоКлиента</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_ПравилаРасчетаКачестваЗаполненияДанных/CRM_ПравилаРасчетаКачестваЗаполненияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПравилаРасчетаКачестваЗаполненияДанных</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСКлиентом</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Правила</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПредставлениеДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаПартнеров</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Ключевой</name>
    <comment>Ключевой контакт</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЛичныеИнтересы</name>
    <comment>Личные интересы контактного лица</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПодключенКB2BПорталу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Состояние</name>
    <type>
      <types>EnumRef.CRM_Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусНаB2BПортале</name>
    <type>
      <types>EnumRef.CRM_СтатусыПользователейB2BПортала</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеровПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛицПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_КлючевыеСобытия</name>
    <comment>Ключевые события контакта</comment>
    <attributes>
      <name>ВидСобытия</name>
      <comment>Вид ключевого события</comment>
      <type>
        <types>CatalogRef.CRM_ВидыКлючевыхСобытий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСобытия</name>
      <comment>Дата ключевого события</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапоминатьОСобытии</name>
      <comment>Напоминать о ключевом событии</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.CRM_СтатусыКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_СтатусыРаботыСКлиентом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик получения формы справочника.
//
// Параметры:
//	ВидФормы					- Строка	- Вид формы справочника.
//	Параметры					- Структура	- Параметры, переданные для формы.
//	ВыбраннаяФорма				- Строка	- Имя открываемой формы справочника.
//	ДополнительнаяИнформация	- Строка	- Дополнительная информация.
//	СтандартнаяОбработка		- Булево	- Признак стандартной обработки.
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.Предопределенный Тогда
				// Запрещаем редактировать предопределенный элемент.
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ФормаЭлемента";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаПолученияФормы()

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	Если Не Параметры.Свойство("ФильтроватьПоСпособуУстановки") Тогда
		Возврат;
	КонецЕсли;
	Ответственный = Неопределено;
	Если Параметры.Свойство("Ответственный", Ответственный)
		И ЗначениеЗаполнено(Ответственный) Тогда
		МассивРуководителей = CRM_УправлениеДоступомПовтИсп.ПолучитьРуководителейПользователя(Ответственный);
		Если МассивРуководителей.Найти(Пользователи.ТекущийПользователь()) <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СтатусыРаботыСКлиентом.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СтатусыРаботыСКлиентом КАК CRM_СтатусыРаботыСКлиентом
	                      |ГДЕ
	                      |	CRM_СтатусыРаботыСКлиентом.СпособУстановки = &СпособУстановки
	                      |	И НЕ CRM_СтатусыРаботыСКлиентом.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_СтатусыРаботыСКлиентом.РеквизитДопУпорядочивания");
	
	Запрос.УстановитьПараметр("СпособУстановки", Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Вручную);
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция возвращает статус работы для нового клиента.
// 
// Возвращаемое значение:
//   - СправочникСсылка.CRM_СтатусыРаботыСКлиентом, Неопределено
//
Функция СтатусНовогоКлиента() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	CRM_СтатусыРаботыСКлиентом.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СтатусыРаботыСКлиентом КАК CRM_СтатусыРаботыСКлиентом
	                      |ГДЕ
	                      |	CRM_СтатусыРаботыСКлиентом.СпособУстановки = &СпособУстановки
	                      |	И НЕ CRM_СтатусыРаботыСКлиентом.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_СтатусыРаботыСКлиентом.РеквизитДопУпорядочивания");
	Запрос.УстановитьПараметр("СпособУстановки", Перечисления.CRM_СпособыУстановкиСтатусаКлиента.ДляНовогоКлиента);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция возвращает структуру шаблонов расчета.
// 
// Возвращаемое значение:
//   - Структура
//
Функция ШаблоныРасчета() Экспорт
	
	Шаблоны = Новый Структура;
	
	// Способ расчета "СКД" - рассчитывается на основе схемы компоновки данных из макета
	// Способ расчета "Метод" - рассчитывается в указанной процедуре
	// Пример:
	//Шаблоны.Вставить("Свой", Новый Структура("Заголовок, СпособРасчета, Путь",
	//	"Свой шаблон", "Метод", "ОбщийМодуль.РасчетСтатуса"));
	// Процедура РасчетСтатуса(УстанавливаемыйСтатус, НачалоРасчета)
	
	ПрефиксМакета = "";
	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ПрефиксМакета = "Модуль_";
	КонецЕсли;
	
	Шаблоны.Вставить("ВПроработке", Новый Структура("Заголовок, СпособРасчета, Путь, Описание",
		НСтр("ru = 'В проработке'"), "СКД", ПрефиксМакета + "Расчет_ВПроработке",
		НСтр("ru = 'Предыдущий статус клиента - Новый.
              |
              |По клиенту за последние 30 дней есть активные Интересы,
              |но при этом:
              |- нет успешно завершенных интересов;
              |- нет оплат
              |- нет отгрузок'")));
	Шаблоны.Вставить("Активный", Новый Структура("СпособРасчета, Путь, Описание",
		"СКД", ПрефиксМакета + "Расчет_Активный",
		НСтр("ru = 'Предыдущий статус клиента - Новый, В проработке, Возвращенный.
              |
              |По клиенту за последние 30 дней: 
              |- есть успешно завершенные Интересы;
              |- или есть оплаты;
              |- или есть отгрузки'")));
	Шаблоны.Вставить("Потерянный", Новый Структура("СпособРасчета, Путь, Описание",
		"СКД", ПрефиксМакета + "Расчет_Потерянный",
		НСтр("ru = 'Предыдущий статус клиента - Активный, В проработке, Возвращенный.
              |
              |По клиенту за последние 30 дней:
              |- нет активных Интересов;
              |- нет успешно завершенных Интересов;
              |- нет отгрузок;
              |- нет оплат'")));
	Шаблоны.Вставить("Возвращенный", Новый Структура("СпособРасчета, Путь, Описание",
		"СКД", ПрефиксМакета + "Расчет_Возвращенный",
		НСтр("ru = 'Предыдущий статус клиента - Потерянный.
              |
              |По клиенту за последние 30 дней: 
              |- есть активные Интересы;
              |- нет успешно завершенных Интересов;
              |- нет оплат;
              |- нет отгрузок'")));
	Шаблоны.Вставить("Ликвидирован", Новый Структура("СпособРасчета, Путь, Описание",
		"СКД", ПрефиксМакета + "Расчет_Ликвидирован",
		НСтр("ru = 'Статус выставляется автоматически 
              |при проверке контрагента связанного с клиентом с помощью
              |сервиса 1С:Контрагент'")));
	
	Возврат Шаблоны;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПереходНаНовуюВерсию

Процедура НачальноеЗаполнениеДанных() Экспорт
	
	Если Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Шаблоны = ШаблоныРасчета();
	
	// Новый клиент
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Новый'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.ДляНовогоКлиента;
	Элемент.ЦветФона = "224;255;255";
	Элемент.Описание = НСтр("ru = 'Зарегистрирован новый клиент. 
                            |По клиенту нет истории с нашей организацией.'");
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Новый");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Новый");
	Правило.Записать();
	
	// В проработке
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'В проработке'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Автоматически;
    Элемент.ШаблонРасчета = "ВПроработке";
	Макет = ПолучитьМакет("Расчет_ВПроработке");
	Элемент.НастройкиРасчета = Новый ХранилищеЗначения(Макет.НастройкиПоУмолчанию);
	Элемент.ЦветФона = "255;251;240";
	Элемент.Описание = Шаблоны["ВПроработке"].Описание;
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "ВПроработке");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "ВПроработке");
	Правило.Записать();
	
	// Активный
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Активный'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Автоматически;
    Элемент.ШаблонРасчета = "Активный";
	Макет = ПолучитьМакет("Расчет_Активный");
	Элемент.НастройкиРасчета = Новый ХранилищеЗначения(Макет.НастройкиПоУмолчанию);
	Элемент.ЦветФона = "215;240;199";
	Элемент.Описание = Шаблоны["Активный"].Описание;
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Активный");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Активный");
	Правило.Записать();
	
	// Потерянный
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Потерянный'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Автоматически;
    Элемент.ШаблонРасчета = "Потерянный";
	Макет = ПолучитьМакет("Расчет_Потерянный");
	Элемент.НастройкиРасчета = Новый ХранилищеЗначения(Макет.НастройкиПоУмолчанию);
	Элемент.ЦветФона = "238;130;238";
	Элемент.Описание = Шаблоны["Потерянный"].Описание;
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Потерянный");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Потерянный");
	Правило.Записать();
	
	// Возвращенный
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Возвращенный'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Автоматически;
    Элемент.ШаблонРасчета = "Возвращенный";
	Макет = ПолучитьМакет("Расчет_Возвращенный");
	Элемент.НастройкиРасчета = Новый ХранилищеЗначения(Макет.НастройкиПоУмолчанию);
	Элемент.ЦветФона = "143;188;139";
	Элемент.Описание = Шаблоны["Возвращенный"].Описание;
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Возвращенный");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Возвращенный");
	Правило.Записать();
	
	// Ликвидирован
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Ликвидирован'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Автоматически;
    Элемент.ШаблонРасчета = "Ликвидирован";
	Макет = ПолучитьМакет("Расчет_Ликвидирован");
	Элемент.НастройкиРасчета = Новый ХранилищеЗначения(Макет.НастройкиПоУмолчанию);
	Элемент.ЦветФона = "220;220;220";
	Элемент.Описание = Шаблоны["Ликвидирован"].Описание;
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Ликвидирован");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Ликвидирован");
	Правило.Записать();
	
	// Чужой
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Чужой'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Вручную;
	Элемент.ЦветФона = "255;255;0";
	Элемент.Описание = НСтр("ru = 'Статус указывается вручную. 
                             |Пользователь имеющий доступ к редактированию карточки клиента
                             |имеет возможность указания данного статуса.
                             |Чужим считается клиент, который является клиентом у наших конкурентов.
                             |
                             |Статус, назначенный вручную, не может быть изменен автоматическими
                             |правилами расчета.'");
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Чужой");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Чужой");
	Правило.Записать();
	
	// Нецелевой
	Элемент = СоздатьЭлемент();
	Элемент.Наименование = НСтр("ru = 'Нецелевой'");
	Элемент.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Вручную;
	Элемент.ЦветФона = "220;220;220";
	Элемент.Описание = НСтр("ru = 'Статус указывается вручную. 
                             |Пользователь имеющий доступ к редактированию карточки клиента
                             |имеет возможность указания данного статуса.
                             |
                             |Статус, назначенный вручную, не может быть изменен автоматическими
                             |правилами расчета.'");
	Элемент.Записать();
	
	// Правило заполнения клиентов
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.Партнеры";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Партнеры'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Нецелевой");
	Правило.Записать();
	// Правило заполнения контактных лиц
	Правило = Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.СоздатьЭлемент();
	Правило.ТипОбъекта = "Справочник.КонтактныеЛицаПартнеров";
	Правило.СтатусРаботыСКлиентом = Элемент.Ссылка;
	Правило.Наименование = НСтр("ru = 'Контактные лица'") + " " + Элемент.Наименование;
	Справочники.CRM_ПравилаРасчетаКачестваЗаполненияДанных.ЗаполнитьПравилоПоШаблону(Правило, "Нецелевой");
	Правило.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПриПереходеНаВерсию() Экспорт
	
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписатьОбъект = Ложь;
		Объект = Выборка.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Объект.СпособУстановки) Тогда
			Если Объект.ИмяПредопределенныхДанных = "#210cbf20-fbdf-449b-bcb9-af854d35be1c" Тогда
				Объект.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.ДляНовогоКлиента;
			Иначе
				Объект.СпособУстановки = Перечисления.CRM_СпособыУстановкиСтатусаКлиента.Вручную;
			КонецЕсли;
			ЗаписатьОбъект = Истина;
		КонецЕсли;
		Если ЗаписатьОбъект Тогда
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	МЗ = РегистрыСведений.CRM_НастройкиРасположенияЭлементовНаФормах.СоздатьМенеджерЗаписи();
	МЗ.ИмяФормы = "Справочник.Партнеры.Форма.CRM_ФормаЭлементаНовая";
	МЗ.ИмяЭлемента = "CRM_СтатусРаботы";
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		МЗ.Удалить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
